{ "_id" : { "$oid" : "576bca184b9c824432eaeb2e" }, "name" : "Acadia National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Acadia_604.jpg?itok=7FWkEnlu", "desc" : "\n          <p><strong>Why It’s Cool:</strong> Maine is known as The Pine Tree State for a reason: It’s covered in 17 million acres of forest. Plus it has 6,000 lakes and ponds and 32,000 miles of rivers and streams—basically, a camper’s paradise. Located on Mount Desert Island, Acadia National Park is the ideal destination for nature lovers of all skill levels. Looking for a unique experience?  to the top of HikeCadillac Mountain (the highest point along the east coast) just before sunrise and be the first person in the U.S. to see the sun that morning.</p>\n\n<p><strong>Where to Camp:</strong> The park has two campgrounds: Blackwoods (closer to the island’s town center, Bar Harbor) and Seawall (a more rustic, less touristy environment). While visitors can enjoy hiking throughout the entire park, camping is only allowed in these designated areas (backcountry enthusiasts, take note).</p>\n\n<p><strong>When It's Open:</strong> Blackwoods campground is open year-round (permit required December to March). Seawall is open from late May through September.</p>\n\n<p><strong>Fee:</strong> Blackwoods costs $30 per site, per night from May to October; $10 in April and November; and it's free from December to March. Seawall will set you back $22 for a walk-in site and $30 for drive-up tent, camper, and motor home sites. For more information, visit the park's website.  </p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb2f" }, "name" : "White Mountains National Forest", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/White%20Mountains_604.jpg?itok=PebUIb0m", "desc" : "\r\n\r\n <p><strong>Why It’s Cool: </strong>If you're looking for a more rustic experience in the Northeast, the White Mountains are your best bet. The hiking’s pretty rugged in this section of the Appalachian range, but totally worth it if you’re up for the challenge. The sights here are particularly stunning in the fall, when the foliage turns to all shades of red, orange, and yellow.</p>\r\n\r\n<p><strong>Where to Camp:</strong> While the forest does have 24 drive-in campgrounds (with a combined 800 campsites—wowza!), the eight walk-in state park campgrounds in the northern part of the state are really what camping’s all about. Developed campsites require reservations. Backcountry tent camping is also allowed (except in noted no-camping areas); there are also log lean-tos scattered throughout the forest (a small fee may apply).</p>\r\n\r\n<p><strong>When It’s Open:</strong> Forest accessible year-round. Visitor center hours vary.</p>\r\n\r\n<p><strong>Cost: </strong>Daily passes to the park are available for $3; seven-day passes available for $5. Campsites vary from $18 to $24 per night, while backcountry tent camping is free. Parking at a trailhead may require a permit; check signage at your chosen lot. For more information, visit the park's website.</p>\r\n        ", "__v" : 5, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb30" }, "name" : "Green Mountains National Forest", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Green%20Mountains_604.jpg?itok=7LzxDXC6", "desc" : "\n          <p><strong>Why It’s Cool:</strong> Vermont's Long Trail is one of the Green Mountain State Park's biggest draws, so try finding a camping spot close by to hike a portion of it during your stay. Aside from being absolutely gorgeous, the 270-plus-mile trail is the oldest long-distance trail in the U.S.! It follows the ridge of the Green Mountains through Vermont from the Massachusetts border to Canada.</p>\n\n<p><strong>Where to Camp:</strong> The forest offers five developed campgrounds. There are no electrical hookups or dump stations, so arrive prepared. Campground accessibility varies by season. Dispersed or backcountry camping is allowed anywhere in the park unless specifically posted.</p>\n\n<p><strong>When It’s Open:</strong> Year-round. Visitor center and campground accessibility vary by season, but one campground is always open all year.</p>\n\n<p><strong>Cost:</strong> The best part? There are no entrance fees, and most of the campsites are free too. The Green Mountain Club maintains about 70 campsites along The Long Trail, all with a water source and privy, for which GMC caretakers will come by to charge a small fee during the summer and fall. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb31" }, "name" : "Pine Grove Furnace State Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Pine%20Grove%20Furnace_604.jpg?itok=iWGAL4kj", "desc" : "\n          <p><strong>Why It’s Cool:</strong> Located in south-central Pennsylvania, this scenic park sits at the northern tip of the Blue Ridge Mountains in an area known as South Mountain (confusing, we know). The Appalachian Trail, perhaps the most famous foot trail in the world, runs through the forest, which is home to the trail’s halfway point. While only 2,000 people attempt to hike the whole 2,186-mile trail each year (about a quarter actually finish), between 2 and 3 million people hike or walk a portion of it. Whether you cover two miles or 20, it’s still cool to say you’ve done it! Have some time after the hike? Check out the Appalachian Trail Museum, located near the midpoint of the AT.</p>\n\n<p><strong>Where to Camp:</strong> The forest has a mix of 70 tent and trailer sites (mostly rustic) available from late March to mid-December. Reservations can be made up to 11 months in advance. Backpacking and overnight hikes are not permitted. Electric and water hook-ups are available for a fee at specific sites. </p>\n\n<p><strong>When It’s Open:</strong> Year-round. Campgrounds open from April through December.</p>\n\n<p><strong>Cost:</strong> No entrance fee. Backpacking or river camping ranges from $4 to $5 per night, while basic campsites start at $15 per night. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb32" }, "name" : "Awesome Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Assateague_604_0.jpg?itok=Bm8f_0YL", "desc" : "          <p><strong>Why It’s Cool:</strong> If you love beaches <em>and</em> camping, this is the spot for you. Assateague is a barrier island off the coast of Maryland and Virginia covered in sandy beaches, salt marshes, forests, and costal bays. There’s even a community of wild horses (how exotic!). Enjoy relaxing on the 37 miles of beach or hiking by day, and buckle down your tent right by (er, a safe distance from) the crashing waves for a night under the stars.</p>\r\n\r\n<p><strong>Where to Camp:</strong> Camping is only allowed on the Maryland side of the island at two oceanside and four bayside camping areas. From October 16­ through April 14, the sites are first-come, first-served. Two campsites are also open for horse camping during this time (for a fee of $50 per night). From April 15 through October 15, reservations can be made up to six months in advance. Backcountry camping is allowed ($10, seven-day permit required), but it's only accessible by backpacking or water.</p>\r\n\r\n<p><strong>When It’s Open: </strong>Year-round; visitor center and ranger station hours vary from season to season.</p>\r\n\r\n<p>Cost: $20 vehicle entrance fee, valid for seven days. Campsite fee is $30 per night depending on season and location. For more information, visit the park's website.</p>\r\n        ", "__v" : 10, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb33" }, "name" : "Yosemite National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Yosemite_604_0.jpg?itok=z9qZNnIY", "desc" : "\n          <p><strong>Why It’s Cool:</strong> Nearly 95 percent of this breathtaking park is designated wilderness—meaning no cars, no structures, no roads, and no electricity. After a night spent under the stars, hike up to Glacier Point, which overlooks the park’s famous Yosemite Valley, Half Dome (a rock structure revered among climbers), and the High Sierra peaks. The Four Mile Trail route takes about three to four hours each way. Looking for even more of a challenge? The Panorama Trail is about twice as long.</p>\n\n<p><strong>Where to Camp: </strong>There are 13 popular campgrounds scattered throughout the park, and reservations are strongly recommended from April to September. But seven campgrounds operate on a first-come first-served basis year-round. Backcountry camping is also allowed, but requires a free wilderness permit (which can be reserved ahead of time). </p>\n\n<p><strong>When It’s Open: </strong>Park open year round. Campgrounds vary by season.</p>\n\n<p><strong>Cost:</strong> $30 per vehicle for a seven-day pass ($25 from November to March). Campsites range from $6 to $26 per night. For more information, visit the park's website.</p>\n        ", "__v" : 2, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb34" }, "name" : "Joshua Tree", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Joshua%20Tree_604_0.jpg?itok=L7ECTPJs", "desc" : "\n          <p><strong>Why It’s Cool:</strong> We know, camping in the desert doesn’t sound like so much fun (hello, sunburn). But the nearly 800,000-acre Joshua Tree National Park is <em>so</em> much more than just desert. The park sits at the intersection of two very different ecosystems: To the east is the low-lying Colorado Desert; to the west lies the slightly higher, cooler, wetter Mojave Desert (home to the park’s namesake, the Joshua tree). The park also has ten mountain peaks higher than 5,000 feet in elevation, making it a popular rock climbing destination. (Just be sure you know what you’re doing first.)</p>\n\n<p><strong>Where to Camp: </strong>The park is home to nine established campgrounds. Some campsites require reservations for October through May. The rest of the sites are first-come, first-served. Backcountry camping is allowed, but campers must register in advance at a designated backcountry registration board.</p>\n\n<p><strong>When It’s Open: </strong>Year-round. Visitor center and campground status vary by season.</p>\n\n<p><strong>Cost: </strong>$20 per vehicle entrance fee, valid for seven days. Annual passes are available for $30 and national passes are accepted. Camping costs $15 per site per night without water, or $20 with potable water available. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb35" }, "name" : "Olympic National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Olympic_604.jpg?itok=kdjpUlj2", "desc" : "\n          <p><strong>Why It’s Cool:</strong> You'll encounter three different ecosystems in one park, including a rainforest. Head to the Quinault Rainforest (one of only three in the western hemisphere) to see the largest Sitka Spruce tree in the world. There’s a 30-mile road that loops through the rainforest, but we think hiking’s a better option. End your trip at Ruby Beach, where you can see mountains, glaciers, and rainforests right from the shoreline—or at La Push, the northernmost beach in Washington, where you can see whales off the coast during migration season.</p>\n\n<p><strong>Where to Camp:</strong> The park has 16 National Park Service-operated campgrounds with a total of 910 sites. Backcountry camping is allowed, but a permit ($5) is required (reservations are also sometimes required). If you're not a tent enthusiast, stay in one of the rustic lodges open year-round. </p>\n\n<p><strong>When It’s Open: </strong>Park is open year-round. Camping availability varies, but there are some primitive sites open year-round.</p>\n\n<p><strong>Cost: </strong>$20 per vehicle entrance fee, valid for seven days. Campground fees range from $15 to $22 per night depending on season and location. A wilderness camping permit is required for backcountry camping: $5 per person, per night. For more information visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb36" }, "name" : "Zion National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Zion_604_0.jpg?itok=OJWdN9pD", "desc" : "\n          <p><strong>Why It’s Cool:</strong> With massive sandstone cliffs, brilliant blue skies, and a plethora of plants and animals, this almost otherworldly park is truly a national treasure. After spending the night in the woods, hike the Kolob Canyons in the northwest corner of the park. The five-mile and 14-mile trails make perfect four- or eight- hour trips. The longer trail takes you to Kolob Arch, one of the largest (and most remote) natural arches in the world. If you’re traveling in the summer and score a permit ($5), exploring The Subway, a unique tunnel structure sculpted by a creek, is an unparalleled experience.</p>\n\n<p><strong>Where to Camp: </strong>The park has three established campgrounds, which are full every night during summer. Wilderness permits are required for all overnight backpacking trips and can be issued the day before or day of your trip (or reserved up to three months in advance). Before you go, be sure to read through the Zion wilderness guide.</p>\n\n<p><strong>When It’s Open:</strong> Year-round. Some services and facilities may reduce hours or close at some point during the year.</p>\n\n<p><strong>Cost:</strong> $30 per vehicle for a recreational seven-day pass. Wilderness permits are $10 to $20 depending on the size of the group. Campsite fees range from free to $16 per night. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb38" }, "name" : "Grand Teton National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Grand%20Teton_604.jpg?itok=J-o97_cL", "desc" : "          <p><strong>Why It’s Cool</strong>: Located just north of Jackson Hole, WY, Grand Teton is home to a number of impressive Rocky Mountain peaks, majestic lakes, and incredible wildlife. There are a ton of hiking trails ranging from easy to very strenuous, so you can choose your own adventure based on how you’re feeling that day.</p>\r\n\r\n<p><strong>Where to Camp: </strong>Stay at one of the five campgrounds in the park (Signal Mountain earns enthusiastic reviews). All backcountry camping requires a permit, which is free and available to walk-ins on a first-come first-served basis. (You may also be able to register online depending on the time of year, but it will cost you $25.)</p>\r\n\r\n<p><strong>When It’s Open:</strong> Year-round. Visitor center hours vary by season, but one visitor center will always be open year-round.</p>\r\n\r\n<p><strong>Cost:</strong> $30 per vehicle entrance fee, valid for seven days. All entrance fees are valid at both Grand Teton and Yellowstone National Parks. In the winter, there is a winter day-use fee of $5. Some national passes are also accepted. Campground fees are $22 per night, per site. For more information, visit the park's website.</p>\r\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb39" }, "name" : "Arches National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Arches_604.jpg?itok=oPNZZt6M", "desc" : "\n          <p><strong>Why It’s Cool:</strong> It’s a red rock wonderland with more than 2,000 natural stone arches, offering a variety of easy, moderate, and long trails. One of the most popular, the Delicate Arch trail, takes you to the spectacular arch of the same name (don't miss the Instagram-worthy photo op!). Or take a ranger-guided hike through the Fiery Furnace, an area of sandstone canyons with no marked trailheads.</p>\n\n<p><strong>Where to Camp:</strong> The park has one developed campground, The Devils Garden Campground, with 50 campsites. Reserve in advance during the busy season (March to October), but there are also campgrounds located outside the park in the Moab area. Since the park is relatively small, there’s little land for backpacking. To do so, you need a free permit, and you should know what you’re doing (be able to read a topographic map, identify safety hazards, etc.).</p>\n\n<p><strong>When It’s Open: </strong>Year-round. Visitor center is open every day except Christmas (hours change based on season).</p>\n\n<p><strong>Cost:</strong> Beginning October 1, 2015, a seven-day pass will cost $25 per vehicle (it's currently $10). Annual passes also available. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3a" }, "name" : "Grand Canyon National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Grand%20Canyon_604.jpg?itok=ld9P8QJL", "desc" : "\n          <p><strong>Why It’s Cool:</strong> Do you really need a reason? It’s the freakin’ Grand Canyon. The South Rim is more popular, accessible, and busier, while the North Rim is harder to get to, but offers a more secluded stay (and is actually in Utah). Both areas are gorgeous, so you really can’t go wrong. Backcountry hiking is one of the most popular activities, but it can be super tough (yet equally rewarding)—be prepared for a demanding hike that will test your mental and physical prowess. Whitewater rafting trips on the Colorado river are also crowd-pleasers.</p>\n\n<p><strong>Where to Camp:</strong> Reservations are recommended for two of the three developed campgrounds during the summer. Backcountry camping is also allowed with a permit.</p>\n\n<p><strong>When It’s Open: </strong>The South Rim is open year-round, but some facilities will close during winter. The North Rim is open mid-May through mid-October. </p>\n\n<p><strong>Cost: </strong>$30 per private vehicle entrance fee, valid for seven days. Annual passes also available. Campground fees start at $12 per night. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3b" }, "name" : "Big Bend National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Big%20Bend_604.jpg?itok=wpMbkQ6a", "desc" : "\n          <p><strong>Why It’s Cool: </strong>The Rio Grande river runs right through Big Bend, so rafting, canoeing, and kayaking trips are an incredible way to experience the park. If staying dry is more your style, the park is packed with trails covering desert, mountain, and river terrain for day hikes or backpacking trips. One popular desert hike is Devil’s Den, a moderate 5.6-mile trip along the rim of and down into a limestone slot canyon. Another beautiful hike is the Santa Elena Canyon trail, a moderate 1.7 mile round-trip hike that provides both top-down and bottom-up views of the canyon. Oh, and don’t forget to look up at night: The park’s remote location provides gorgeous views of the starry sky. </p>\n\n<p><strong>Where to Camp:</strong> The park operates three developed campgrounds. You can find primitive roadside campsites for backcountry camping scattered throughout the park. </p>\n\n<p><strong>When It’s Open</strong>: Year-round. </p>\n\n<p><strong>Cost</strong>: $25 per vehicle entrance fee, valid for seven days. Annual passes also available. Developed campgrounds fees are $14 per site, per night, while backcountry campsites require a $12 permit. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3c" }, "name" : "Carson National Forest", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Carson_604.jpg?itok=os0SB8F7", "desc" : "\n          <p><strong>Why It’s Cool: </strong>Surprise: New Mexico is not all desert! Carson National Forest offers relatively cool summer temps as well as a great environment for fishing, hunting, camping, and hiking. In the winter, there’s even enough snow for skiing, snowshoeing, and snowmobiling. Hike the 16-mile round trip up to New Mexico’s highest peak, Mt. Wheeler, for a challenging but rewarding adventure.</p>\n\n<p><strong>Where to Camp:</strong> You'll find 35 established camping areas scattered throughout the park. Backcountry camping is also allowed. Langua Larga offers four campsites right on the water’s edge and many good areas for dispersed camping (camping anywhere outside a developed campsite) a bit farther from the lake.</p>\n\n<p><strong>When It’s Open:</strong> Forest is accessible year-round. Campgrounds vary by season and location.</p>\n\n<p><strong>Cost:</strong> No entrance fee. Campsite prices range from free to $30, depending on location, time of year, and group size. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3d" }, "name" : "Badlands National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Badlands_604.jpg?itok=5wdCEL_f", "desc" : "\n          <p><strong>Why It’s Cool:</strong> It's a tough climate to trek through—but the scenery is absolutely beautiful. Between a variety of rock formations lies a mixture of tall- and short-grass prairies. And be on the lookout for fossils: The Badlands have one of the most complete fossil accumulations in North America, providing a glimpse into the area’s ancient ecosystems. The park is also ideal for stargazing and even hosts an astronomy festival in early August. </p>\n\n<p><strong>Where to Camp:</strong> There are two campgrounds in the park: Cedar Pass Campground has some amenities (running water, electricity, etc.). Sage Creek Campground is primitive (bison often wander through!) without water on-site. Permits are not required for backcountry camping, but you do need and register before heading out.</p>\n\n<p><strong>When It’s Open:</strong> Park and campgrounds are open year-round.</p>\n\n<p><strong>Cost: </strong>$15 per vehicle entrance fee, valid for seven days. Annual and national passes also available. Campsites at Cedar Pass Campground are $13 per night, per site; $30 per night, per site with electrical hook-ups. Sage Creek campsites are free. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3e" }, "name" : "Voyagers National Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Voyagers_604.jpg?itok=CXZeWyBt", "desc" : "\n          <p><strong>Why It’s Cool:</strong> This park offers something different every season: Summer and spring are perfect for water activities; fall turns the park into a hiking paradise; and winter calls to cross-country skiers, snow-shoers and snowmobilers, and ice fishers. The park is composed of mostly water, so for those entering the park without their own vessel, guided boat tours are a popular activity (make sure to reserve in advance!). There are also a wide variety of hiking trails, accessible by both car and boat.</p>\n\n<p><strong>Where to Camp: </strong>The park features 220 free, designated campsites, but all are accessible only by water. They're available on a first-come, first-served basis. Backcountry camping is also allowed anywhere in the park (unless otherwise stated).</p>\n\n<p><strong>When It’s Open: </strong>Year-round; visitor center hours vary by season.</p>\n\n<p><strong>Cost: </strong>Entrance is free, but there's a $10 daily fee for private boating. No charge or reservations for individual campsites, but a free permit is required. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
{ "_id" : { "$oid" : "576bca184b9c824432eaeb3f" }, "name" : "Ludington State Park", "src" : "http://greatist.com/sites/default/files/styles/article_main/public/Ludington_604.jpg?itok=Q51R5nQn", "desc" : "\n          <p><strong>Why It’s Cool:</strong> This 5,300-acre park is sandwiched right between two lakes (Hamlin Lake and Lake Michigan) in western Michigan. You'll find everything from sand dunes and shoreline to marshlands and forest, plus eight separate trails covering 21.5 miles. Canoeing offers gorgeous, up-close views of the water, and you can also bike on the designated 2-mile trail. </p>\n\n<p><strong>Where to Camp: </strong>Choose from three modern campgrounds with a total of 355 campsites featuring showers and bathrooms, plus three mini-cabins. There are also 10 remote sites in a hike-in only campground. </p>\n\n<p><strong>When It’s Open:</strong> Year-round, but camping is only allowed mid-May to late November.</p>\n\n<p><strong>Cost:</strong> $11 fee to purchase the required Michigan State Park Recreation Passport. For more information, visit the park's website.</p>\n        ", "__v" : 1, "comments" : [], "author" : { "id" : { "$oid" : "577a86b0515672d727da6b21" }, "username" : "God" } }
